app/Controllers/DashboardDioController.php

  public function ajax_input_output()
  {
    $builder = $this->db->table('di_status');
    $builder->select('*');
    $builder->join('config_di', 'config_di.id = di_status.id', 'left');
    $data['di'] = $builder->get()->getResult();
    $builder = $this->db->table('config_lvd');
    $builder->select('*');
    $builder->join('lvd_status', 'lvd_status.id = config_lvd.id', 'left');
    $data['lvd'] = $builder->get()->getResult();
---
SELECT *
FROM `di_status`
LEFT JOIN `config_di` ON `config_di`.`id` = `di_status`.`id`
SELECT *
FROM `config_lvd`
LEFT JOIN `lvd_status` ON `lvd_status`.`id` = `config_lvd`.`id`