app/Controllers/DashboardDashController.php

  public function ajax_main_dashboard_pv()
  {
    $builder = $this->db->table('power_batt');
    $builder->select('*');
    $data['batt'] = $builder->get()->getResult();
    $builder = $this->db->table('measurement');
    $builder->select('*');
    $data['load'] = $builder->get()->getResult();
    $builder = $this->db->table('power_pv');
    $builder->select('*');
    $builder->where('id !=', 3);
    $builder->where('id !=', 4);
    $data['power'] = $builder->get()->getResult();
---
SELECT *
FROM `power_batt`
SELECT *
FROM `measurement`
SELECT *
FROM `power_pv`
WHERE `id` != 3
AND `id` != 4

  public function ajax_main_dashboard_batt()
  {
    $builder = $this->db->table('power_batt');
    $builder->select('*');
    $data['batt'] = $builder->get()->getResult();
    $builder = $this->db->table('measurement');
    $builder->select('*');
    $data['load'] = $builder->get()->getResult();
    $builder = $this->db->table('power_pv');
    $builder->select('*');
    $builder->where('id !=', 3);
    $builder->where('id !=', 4);
    $data['power'] = $builder->get()->getResult();
---
SELECT *
FROM `power_batt`
SELECT *
FROM `measurement`
SELECT *
FROM `power_pv`
WHERE `id` != 3
AND `id` != 4

  public function ajax_main_dashboard_load()
  {
    $builder = $this->db->table('power_batt');
    $builder->select('*');
    $data['batt'] = $builder->get()->getResult();
    $builder = $this->db->table('measurement');
    $builder->select('*');
    $data['load'] = $builder->get()->getResult();
    $builder = $this->db->table('power_pv');
    $builder->select('*');
    $builder->where('id !=', 3);
    $builder->where('id !=', 4);
    $data['power'] = $builder->get()->getResult();
---
SELECT *
FROM `power_batt`
SELECT *
FROM `measurement`
SELECT *
FROM `power_pv`
WHERE `id` != 3
AND `id` != 4