app/Controllers/SetLVDController.php

SELECT *
FROM `config_lvd`
---
  public function data_lvd()
  {
    $builder = $this->db->table('config_lvd');
    $builder->select('*');
    $io_data = $builder->get()->getResult();
    return json_encode($builder->get()->getResult());